#include<stdio.h>

/* Трима спортни състезатели финишират за някакъв брой секунди (между 1 и 50).
 Да се напише програма, която чете времената на състезателите, въведени от потребителя,
  и пресмята сумарното им време във формат "минути:секунди". Секундите да се изведат с водеща нула
  (2 -> "02", 7 -> "07", 35 -> "35") */

int main(void)
{
    int s1,s2,s3,m;

    scanf("%d",&s1);
    scanf("%d",&s2);
    scanf("%d",&s3);
    s1 += s2+s3;
    m = s1/60; s1 = s1-m*60;
    printf("%d:%0.2d",m,s1);
    return 0;
}
