#include<stdio.h>

/* Да се напише програма, която чете час и минути от 24-часово денонощие,
въведени от потребителя, и изчислява колко ще е часът след 15 минути.
Резултатът да се отпечата във формат hh:mm. Часовете винаги са между 0 и 23,
а минутите винаги са между 0 и 59. Часовете се изписват с една или две цифри.
Минутите се изписват винаги с по две цифри, с водеща нула когато е необходимо. */


 int main(void){
int h,m;
scanf("%d %d", &h, &m);

m += 15;

if(m>=60) {m-=60;h++;}
if(h==24) h=0;

printf("%d:%0.2d",h,m);

 return 0;}
