#include<stdio.h>

/* Напишете програма, която проверява дали точка {x, y}
 се намира вътре в правоъгълник {x1, y1} – {x2, y2}.
  Входните данни се четат от конзолата и се състоят от 6 реда,
   въведени от потребителя: десетичните числа x1, y1, x2, y2, x и y (като се гарантира, че x1 < x2 и y1 < y2).
   Една точка е вътрешна за даден правоъгълник, ако се намира някъде във вътрешността
   му или върху някоя от страните му. Отпечатайте “Inside” или “Outside” */


   int main(void)
   {
       int x1,y1,x2,y2,x,y;
       scanf("%d %d",&x1,&y1);
       scanf("%d %d",&x2,&y2);
       scanf("%d %d",&x,&y);

       if(x1<=x && x<=x2 && y1<=y && y<=y2) printf("Inside");
       else printf("Outside");
       return 0;
   }
