#include<stdio.h>

/* От лозе с площ X квадратни метри се заделя 40% от реколтата за производство на вино.
 От 1 кв.м лозе се изкарват Y килограма грозде. За 1 литър вино са нужни 2,5 кг. грозде.
  Желаното количество вино за продан е Z литра.

Напишете програма, която пресмята колко вино може да се произведе и дали това количество е достатъчно.
 Ако е достатъчно, остатъкът се разделя по равно между работниците на лозето. */

int main(void)
{
    float X, Y, li, Z;

    scanf("%f",&X);
    scanf("%f",&Y);
    scanf("%f",&Z);

    li = ((0.4*X) * Y) /2.5;
    if(li >= Z) printf("%g li > %g",li,Z);
    else printf("%gli < %g",li,Z);
    return 0;
}
