#include<stdio.h>

/* Дадено е цяло число – брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
 Да се напише програма, която пресмята бонус точките за това число и общия брой точки с бонусите.

Ако числото е до 100 включително, бонус точките са 5.

Ако числото е по-голямо от 100, бонус точките са 20% от числото.

Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

Допълнителни бонус точки (начисляват се отделно от предходните):

За четно число -> + 1 т.

За число, което завършва на 5 -> + 2 т. */

float bonus(int num);

int main(void)
{
    int num;
    float b;
    scanf("%d",&num);
    b = bonus(num);
    printf("bonus : %g\n",b);
    printf("number+bonus : %g",b+num);
    return 0;
}

float bonus(int num)
{
    float b=0;

    if(num<=100) b += 5;
    if(num>100 && num <=1000) b += 0.2*num;
    if(num>1000) b += 0.1*num;

    if(!(num%2)) b+=1;
    if(num%10==5) b+=2;

    return b;
}
