/* Създайте структура, която съхранява информация з а членовете на фитнеса. Съхранявананта
информация за всеки член е:
- две имена (55 символа)
- уникален идентификационен номер("AA1234")
- цена на месечен абонамент (реално число с формат "0.00")
- код на персоланло шкафче (цяло трицифрено число)

Създайте еномерен масив в който да съхранявате членовете. Създайте текстови файл с име
"membersText.txt"
Създайте функция, която:
- приема едномерен масив от тип структура членове
- динамично разширява масива с един елемент
- попълва елемента с информация, въведена от конзолата
- записва елемента в текствия файл с раделител ';' и формат:
"<дължина на низ имена><низ имена><низидент.номер><реално число цена><цяло число номер шкафче>"
Пример: 11;Ivan Ivanov;AA1234;13.50;579

Създайте функция, която приема масив от членове, изчислява средноаритметичната цена от
месечните абонаменти и принтира на конзолата тези членове, които заплащат абонамент под тази сума във формат
"Две имена-Уникален Идентификационен номер-сума"
Ivan Ivanov-AA1234-13.00

Създайте функция, която приема ид("АА1234") след което прочита информациаята от вече създаден
бинарен файл "members.bin" и принтира данните за даденият член на конзолата
<дължина на низ><низ имена><низ идент. номер><реално число цена><цяло число номер шкафче>
Bin Names: Ivan Ivanov
Bin Id: AA1234
Bin M_Price: 13.50
Bin Locker: 579
*/

typedef struct {
    char Name[56];
    char Id[7];
    float price;
    int safe;
} Fitnes;

// Global function

// Global variables
Fitnes* listPeople = NULL;
int size = 0;
const char* output = "membersText.txt";

(Fitnes* list)

int main(void){
}
