#include<stdio.h>

/* Да се състави пргорама, която създава двоичен файл със записи представляващи данни за сътрудник във фирма,
за всеки сътрудник се въвежда ID, часово плащане, брой работени часове за седмица, седмична заплата, общият брой
на сътрудниците да не превишава 30, програмата включва възможност за допълване на нови записи във файла
както и възможност за принтиране на изчислената седмична заплата на екрана, при изчисляване на заплата е необходимо
да се знае че всеки извънреден час, който е над 40 часа седмично се заплаща 150%, а стойността на данъците е 3,65%
от общата за работник. */

int main(void)
{

    return 0;
}
