#include<stdio.h>

/* Градинар продавал реколтата от градината си на зеленчуковата борса.
Продава зеленчуци за N лева на килограм и плодове за M лева за килограм.
 Напишете програма, която да пресмята приходите от реколтата в евро
 ( ако приемем, че едно евро е равно на 1.95лв).
 От конзолата се четат 4 числа, по едно на ред, въведени от потребителя:


  Първи ред – Цена за килограм зеленчуци – число с плаваща запетая
  Втори ред – Цена за килограм плодове – число с плаваща запетая
Трети ред – Общо килограми на зеленчуците – цяло число
 Четвърти ред – Общо килограми на плодовете – цяло число  */


 int main(void)
 {
     float cz,cp; /* цена зеленчуци, плодове */
     int kz, kp; /* килограм зеленчуци, плодове */

     scanf("%f",&cz);
     scanf("%f",&cp);
     scanf("%d",&kz);
     scanf("%d",&kp);

     printf("prihudi: %f", (cz*kz + cp*kp)/1.95);
     return 0;
 }
