#include<stdio.h>

/* Напишете програма, която получава редица с цели N числа.
 След това получава цяло число К. Отместете всички елементи на
  редицата с K позиции, като използвате правилото за превъртане
  (когато елемент от последна позиция трябва да се измести то той
   трябва да отиде на първа позиция в редицата). */

 int main(void)
{
    int N,j,i,tmp,k;
  printf("n = ");
  scanf("%d", &N);

  /* 0 1 2 3 4 5 6 7 */

  printf("k = ");
  scanf("%d", &k);

  int a[N];

  for(i=0;i<N;i++) {printf("a[%d] = ", i);
  scanf("%d", &a[i]);}


  for(j=0; j<k; j++)
   {
       tmp = a[N-1];

       for(i=N-1;i>0;i--)
       {
           a[i] = a[i-1];
       }

       a[0] = tmp;
   }


  for(i=0;i<N;i++) printf("%d ", a[i]);
  return 0;
}
